; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=58, out_folder=htg/blocksworld/training, instance_id=38, seed=2062, goal_proportion=0.1

(define (problem blocksworld-38)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 - object)
 (:init 
    (arm-empty)
    (clear b7)
    (on-table b7)
    (clear b45)
    (on-table b45)
    (clear b53)
    (on b53 b23)
    (on b23 b32)
    (on b32 b43)
    (on b43 b15)
    (on-table b15)
    (clear b3)
    (on-table b3)
    (clear b28)
    (on b28 b12)
    (on b12 b19)
    (on b19 b25)
    (on b25 b20)
    (on b20 b31)
    (on b31 b38)
    (on-table b38)
    (clear b8)
    (on-table b8)
    (clear b18)
    (on b18 b6)
    (on b6 b26)
    (on b26 b13)
    (on b13 b52)
    (on b52 b21)
    (on-table b21)
    (clear b39)
    (on b39 b44)
    (on-table b44)
    (clear b42)
    (on b42 b27)
    (on-table b27)
    (clear b5)
    (on-table b5)
    (clear b9)
    (on b9 b16)
    (on b16 b46)
    (on b46 b50)
    (on b50 b33)
    (on b33 b14)
    (on b14 b56)
    (on b56 b36)
    (on-table b36)
    (clear b41)
    (on-table b41)
    (clear b17)
    (on b17 b1)
    (on b1 b4)
    (on b4 b37)
    (on b37 b30)
    (on b30 b10)
    (on b10 b24)
    (on b24 b58)
    (on b58 b49)
    (on-table b49)
    (clear b35)
    (on b35 b2)
    (on b2 b55)
    (on b55 b54)
    (on-table b54)
    (clear b11)
    (on-table b11)
    (clear b48)
    (on-table b48)
    (clear b47)
    (on-table b47)
    (clear b51)
    (on-table b51)
    (clear b34)
    (on-table b34)
    (clear b29)
    (on-table b29)
    (clear b40)
    (on b40 b22)
    (on-table b22)
    (clear b57)
    (on-table b57))
 (:goal  (and 
    (clear b4)
    (on b4 b5)
    (on b5 b2)
    (on-table b2)
    (clear b1)
    (on-table b1)
    (clear b3)
    (on-table b3))))

; plan
1. (unstack b17 b1)
   deleted: (on b17 b1) (clear b17) (arm-empty)
   added: (holding b17) (clear b1)
   goals met: 3 of 8
2. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 3 of 8
3. (unstack b1 b4)
   deleted: (on b1 b4) (clear b1) (arm-empty)
   added: (holding b1) (clear b4)
   goals met: 3 of 8
4. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 5 of 8
5. (unstack b4 b37)
   deleted: (on b4 b37) (clear b4) (arm-empty)
   added: (holding b4) (clear b37)
   goals met: 4 of 8
6. (stack b4 b5)
   deleted: (clear b5) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b5)
   goals met: 6 of 8
7. (unstack b35 b2)
   deleted: (on b35 b2) (clear b35) (arm-empty)
   added: (holding b35) (clear b2)
   goals met: 6 of 8
8. (putdown b35)
   deleted: (holding b35)
   added: (clear b35) (arm-empty) (on-table b35)
   goals met: 6 of 8
9. (unstack b2 b55)
   deleted: (on b2 b55) (clear b2) (arm-empty)
   added: (holding b2) (clear b55)
   goals met: 6 of 8
10. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 7 of 8
11. (unstack b4 b5)
   deleted: (on b4 b5) (clear b4) (arm-empty)
   added: (holding b4) (clear b5)
   goals met: 5 of 8
12. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 6 of 8
13. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 6 of 8
14. (stack b5 b2)
   deleted: (clear b2) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b2)
   goals met: 7 of 8
15. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 6 of 8
16. (stack b4 b5)
   deleted: (clear b5) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b5)
   goals met: 8 of 8
